# Core package manager/runtime bootstrap
brew "mise"
brew "git"
brew "git-lfs"
brew "gh"
brew "ghq"

# Shell and terminal utilities
brew "coreutils"
brew "direnv"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "tmux"
brew "zoxide"
brew "zsh-abbr"
brew "yazi"
brew "tig"
brew "micro"

# Data/config tooling
brew "age"
brew "jq"
brew "sops"
brew "yq"
brew "sevenzip"

# Language and mobile development
brew "bundletool"
brew "cocoapods"
brew "dotnet@8"
brew "gradle"
brew "ios-deploy"
brew "jenv"
brew "libimobiledevice"
brew "libpq"
brew "openjdk@17"
brew "pipx"
brew "rbenv"

# Build, media, and document tooling
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "resvg"
brew "protobuf"
brew "fswatch"

# Service/infra tools
brew "act"
brew "actionlint"
brew "cloudflared"
brew "docker-compose"
brew "kubernetes-cli"
brew "pinact"
brew "postgresql@15"
brew "tailscale"
brew "terminal-notifier"
brew "yamllint"

# Project-specific CLI tools
brew "rtk-ai/tap/rtk"

# Apps and fonts
cask "font-blex-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "godot"
